layer {
  name: "front"
  time_unit: "usec"
  cpu: 1954.0
  cpu2: 1954.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 15182.0
  cpu2: 15182.0
  gpu: 3611.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 880.0
  cpu2: 880.0
  gpu: 170.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 5432.0
  cpu2: 5432.0
  gpu: 1200.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 7280.0
  cpu2: 7280.0
  gpu: 1569.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 6118.0
  cpu2: 6118.0
  gpu: 1365.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 7286.0
  cpu2: 7286.0
  gpu: 1574.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 7302.0
  cpu2: 7302.0
  gpu: 1566.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 7418.0
  cpu2: 7418.0
  gpu: 1590.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 8204.0
  cpu2: 8204.0
  gpu: 1781.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 7374.0
  cpu2: 7374.0
  gpu: 1599.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 9094.0
  cpu2: 9094.0
  gpu: 1955.0
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 508.0
  cpu2: 508.0
  gpu: 83.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 2206.0
  cpu2: 2206.0
  gpu: 732.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 5348.0
  cpu2: 5348.0
  gpu: 815.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 2486.0
  cpu2: 2486.0
  gpu: 792.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 5340.0
  cpu2: 5340.0
  gpu: 833.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 2664.0
  cpu2: 2664.0
  gpu: 865.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 5300.0
  cpu2: 5300.0
  gpu: 829.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 2948.0
  cpu2: 2948.0
  gpu: 922.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 5274.0
  cpu2: 5274.0
  gpu: 821.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 3146.0
  cpu2: 3146.0
  gpu: 1120.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 5184.0
  cpu2: 5184.0
  gpu: 818.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 3348.0
  cpu2: 3348.0
  gpu: 1203.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 5282.0
  cpu2: 5282.0
  gpu: 832.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 3576.0
  cpu2: 3576.0
  gpu: 1273.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 5324.0
  cpu2: 5324.0
  gpu: 820.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 3832.0
  cpu2: 3832.0
  gpu: 1325.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 5286.0
  cpu2: 5286.0
  gpu: 820.0
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 6394.0
  cpu2: 6394.0
  gpu: 2007.0
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 376.0
  cpu2: 376.0
  gpu: 48.0
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 1072.0
  cpu2: 1072.0
  gpu: 700.0
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 1126.0
  cpu2: 1126.0
  gpu: 717.0
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 1124.0
  cpu2: 1124.0
  gpu: 725.0
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 1142.0
  cpu2: 1142.0
  gpu: 715.0
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 1210.0
  cpu2: 1210.0
  gpu: 755.0
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1134.0
  cpu2: 1134.0
  gpu: 725.0
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 1262.0
  cpu2: 1262.0
  gpu: 783.0
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1132.0
  cpu2: 1132.0
  gpu: 737.0
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1334.0
  cpu2: 1334.0
  gpu: 827.0
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1122.0
  cpu2: 1122.0
  gpu: 735.0
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1426.0
  cpu2: 1426.0
  gpu: 867.0
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1126.0
  cpu2: 1126.0
  gpu: 782.0
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 7760.0
  cpu2: 7760.0
  gpu: 2151.0
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 1512.0
  cpu2: 1512.0
  gpu: 62.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 36.0
  cpu2: 36.0
  gpu: 999999.0
}
