layer {
  name: "front"
  time_unit: "usec"
  cpu: 1954.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 7591.0
  gpu: 3611.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 440.0
  gpu: 170.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 2716.0
  gpu: 1200.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 3640.0
  gpu: 1569.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 3059.0
  gpu: 1365.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 3643.0
  gpu: 1574.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 3651.0
  gpu: 1566.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3709.0
  gpu: 1590.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 4102.0
  gpu: 1781.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 3687.0
  gpu: 1599.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 4547.0
  gpu: 1955.0
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 254.0
  gpu: 83.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1103.0
  gpu: 732.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 2674.0
  gpu: 815.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1243.0
  gpu: 792.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2670.0
  gpu: 833.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 1332.0
  gpu: 865.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 2650.0
  gpu: 829.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 1474.0
  gpu: 922.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 2637.0
  gpu: 821.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1573.0
  gpu: 1120.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2592.0
  gpu: 818.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 1674.0
  gpu: 1203.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2641.0
  gpu: 832.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 1788.0
  gpu: 1273.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 2662.0
  gpu: 820.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1916.0
  gpu: 1325.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 2643.0
  gpu: 820.0
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 3197.0
  gpu: 2007.0
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 188.0
  gpu: 48.0
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 536.0
  gpu: 700.0
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 563.0
  gpu: 717.0
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 562.0
  gpu: 725.0
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 571.0
  gpu: 715.0
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 605.0
  gpu: 755.0
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 567.0
  gpu: 725.0
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 631.0
  gpu: 783.0
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 566.0
  gpu: 737.0
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 667.0
  gpu: 827.0
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 561.0
  gpu: 735.0
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 713.0
  gpu: 867.0
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 563.0
  gpu: 782.0
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 3880.0
  gpu: 2151.0
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 756.0
  gpu: 62.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 36.0
  gpu: 999999.0
}
