layer {
  name: "front"
  time_unit: "usec"
  cpu: 1954.0
  cpu2: 1954.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 7890.0
  cpu2: 7890.0
  gpu: 1628.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1570.0
  cpu2: 1570.0
  gpu: 414.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 1562.0
  cpu2: 1562.0
  gpu: 616.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 2360.0
  cpu2: 2360.0
  gpu: 655.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 3820.0
  cpu2: 3820.0
  gpu: 964.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 2332.0
  cpu2: 2332.0
  gpu: 777.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 2282.0
  cpu2: 2282.0
  gpu: 655.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 3796.0
  cpu2: 3796.0
  gpu: 983.0
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 1122.0
  cpu2: 1122.0
  gpu: 292.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 912.0
  cpu2: 912.0
  gpu: 530.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 1344.0
  cpu2: 1344.0
  gpu: 536.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 5434.0
  cpu2: 5434.0
  gpu: 807.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 1384.0
  cpu2: 1384.0
  gpu: 648.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1368.0
  cpu2: 1368.0
  gpu: 543.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 5388.0
  cpu2: 5388.0
  gpu: 828.0
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 836.0
  cpu2: 836.0
  gpu: 269.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 664.0
  cpu2: 664.0
  gpu: 590.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 736.0
  cpu2: 736.0
  gpu: 453.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1878.0
  cpu2: 1878.0
  gpu: 704.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 770.0
  cpu2: 770.0
  gpu: 707.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 748.0
  cpu2: 748.0
  gpu: 455.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1888.0
  cpu2: 1888.0
  gpu: 709.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 950.0
  cpu2: 950.0
  gpu: 727.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 968.0
  cpu2: 968.0
  gpu: 498.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 2594.0
  cpu2: 2594.0
  gpu: 817.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 1186.0
  cpu2: 1186.0
  gpu: 845.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 966.0
  cpu2: 966.0
  gpu: 520.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 2622.0
  cpu2: 2622.0
  gpu: 823.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 10038.0
  cpu2: 10038.0
  gpu: 2039.0
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 1194.0
  cpu2: 1194.0
  gpu: 57.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 36.0
  cpu2: 36.0
  gpu: 999999.0
}
