layer {
  name: "front"
  time_unit: "usec"
  cpu: 1954.0
  cpu2: 1954.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 5260.0
  cpu2: 15780.0
  gpu: 1628.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 1047.0
  cpu2: 3140.0
  gpu: 414.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 1041.0
  cpu2: 3124.0
  gpu: 616.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 1573.0
  cpu2: 4720.0
  gpu: 655.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2547.0
  cpu2: 7640.0
  gpu: 964.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 1555.0
  cpu2: 4664.0
  gpu: 777.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 1521.0
  cpu2: 4564.0
  gpu: 655.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 2531.0
  cpu2: 7592.0
  gpu: 983.0
}
layer {
  name: "p2"
  time_unit: "usec"
  cpu: 748.0
  cpu2: 2244.0
  gpu: 292.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 608.0
  cpu2: 1824.0
  gpu: 530.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 896.0
  cpu2: 2688.0
  gpu: 536.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 3623.0
  cpu2: 10868.0
  gpu: 807.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 923.0
  cpu2: 2768.0
  gpu: 648.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 912.0
  cpu2: 2736.0
  gpu: 543.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 3592.0
  cpu2: 10776.0
  gpu: 828.0
}
layer {
  name: "p3"
  time_unit: "usec"
  cpu: 557.0
  cpu2: 1672.0
  gpu: 269.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 443.0
  cpu2: 1328.0
  gpu: 590.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 491.0
  cpu2: 1472.0
  gpu: 453.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1252.0
  cpu2: 3756.0
  gpu: 704.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 513.0
  cpu2: 1540.0
  gpu: 707.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 499.0
  cpu2: 1496.0
  gpu: 455.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1259.0
  cpu2: 3776.0
  gpu: 709.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 633.0
  cpu2: 1900.0
  gpu: 727.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 645.0
  cpu2: 1936.0
  gpu: 498.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1729.0
  cpu2: 5188.0
  gpu: 817.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 791.0
  cpu2: 2372.0
  gpu: 845.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 644.0
  cpu2: 1932.0
  gpu: 520.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1748.0
  cpu2: 5244.0
  gpu: 823.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 6692.0
  cpu2: 20076.0
  gpu: 2039.0
}
layer {
  name: "p4"
  time_unit: "usec"
  cpu: 796.0
  cpu2: 2388.0
  gpu: 57.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 36.0
  cpu2: 36.0
  gpu: 999999.0
}
