name: "TestNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 10 dim: 3 dim: 227 dim: 227 } }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  convolution_param {
    num_output: 16
    kernel_size: 1
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  convolution_param {
    num_output: 64
    kernel_size: 1
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv2"
  top: "conv4"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "concat1"
  type: "Concat"
  bottom: "conv3"
  bottom: "conv4"
  top: "concat1"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "concat1"
  top: "conv5"
  convolution_param {
    num_output: 16
    kernel_size: 1
  }
}
layer {
	name: "dummy"
	type: "Softmax"
	bottom: "conv5"	
	top: "dummy"
}
