layer {
  name: "front"
  time_unit: "usec"
  cpu: 1943.0
  cpu2: 1943.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 2849.0
  cpu2: 8548.0
  gpu: 1073.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 3173.0
  cpu2: 9520.0
  gpu: 1137.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 2499.0
  cpu2: 7496.0
  gpu: 538.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 1684.0
  cpu2: 5052.0
  gpu: 742.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 7391.0
  cpu2: 22172.0
  gpu: 1913.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 2272.0
  cpu2: 6816.0
  gpu: 689.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 1283.0
  cpu2: 3848.0
  gpu: 548.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 3404.0
  cpu2: 10212.0
  gpu: 989.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 2925.0
  cpu2: 8776.0
  gpu: 621.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 1704.0
  cpu2: 5112.0
  gpu: 681.0
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 159.0
  cpu2: 476.0
  gpu: 56.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 3259.0
  cpu2: 9776.0
  gpu: 988.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1183.0
  cpu2: 3548.0
  gpu: 442.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 709.0
  cpu2: 2128.0
  gpu: 449.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 1376.0
  cpu2: 4128.0
  gpu: 620.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 1409.0
  cpu2: 4228.0
  gpu: 392.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 840.0
  cpu2: 2520.0
  gpu: 516.0
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 103.0
  cpu2: 308.0
  gpu: 17.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 1444.0
  cpu2: 4332.0
  gpu: 626.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 1400.0
  cpu2: 4200.0
  gpu: 405.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 868.0
  cpu2: 2604.0
  gpu: 524.0
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 104.0
  cpu2: 312.0
  gpu: 18.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 1464.0
  cpu2: 4392.0
  gpu: 629.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 1400.0
  cpu2: 4200.0
  gpu: 407.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1089.0
  cpu2: 3268.0
  gpu: 582.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 2707.0
  cpu2: 8120.0
  gpu: 973.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 2631.0
  cpu2: 7892.0
  gpu: 556.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 1604.0
  cpu2: 4812.0
  gpu: 859.0
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 133.0
  cpu2: 400.0
  gpu: 36.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 2756.0
  cpu2: 8268.0
  gpu: 965.0
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 2649.0
  cpu2: 7948.0
  gpu: 563.0
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 1661.0
  cpu2: 4984.0
  gpu: 863.0
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 132.0
  cpu2: 396.0
  gpu: 36.0
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 2728.0
  cpu2: 8184.0
  gpu: 981.0
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 2652.0
  cpu2: 7956.0
  gpu: 552.0
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 1640.0
  cpu2: 4920.0
  gpu: 861.0
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 133.0
  cpu2: 400.0
  gpu: 36.0
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 2817.0
  cpu2: 8452.0
  gpu: 979.0
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1012.0
  cpu2: 3036.0
  gpu: 436.0
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 640.0
  cpu2: 1920.0
  gpu: 582.0
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1331.0
  cpu2: 3992.0
  gpu: 692.0
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1220.0
  cpu2: 3660.0
  gpu: 433.0
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 975.0
  cpu2: 2924.0
  gpu: 757.0
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 84.0
  cpu2: 252.0
  gpu: 15.0
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 1349.0
  cpu2: 4048.0
  gpu: 696.0
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1203.0
  cpu2: 3608.0
  gpu: 436.0
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 987.0
  cpu2: 2960.0
  gpu: 752.0
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 77.0
  cpu2: 232.0
  gpu: 15.0
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 1376.0
  cpu2: 4128.0
  gpu: 705.0
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 804.0
  cpu2: 2412.0
  gpu: 392.0
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 1168.0
  cpu2: 3504.0
  gpu: 713.0
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 2015.0
  cpu2: 6044.0
  gpu: 600.0
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 1117.0
  cpu2: 3352.0
  gpu: 359.0
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 1809.0
  cpu2: 5428.0
  gpu: 946.0
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 83.0
  cpu2: 248.0
  gpu: 13.0
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 1980.0
  cpu2: 5940.0
  gpu: 594.0
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 1100.0
  cpu2: 3300.0
  gpu: 363.0
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 1816.0
  cpu2: 5448.0
  gpu: 950.0
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 81.0
  cpu2: 244.0
  gpu: 13.0
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 1963.0
  cpu2: 5888.0
  gpu: 606.0
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 1112.0
  cpu2: 3336.0
  gpu: 358.0
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 3265.0
  cpu2: 9796.0
  gpu: 991.0
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 4137.0
  cpu2: 12412.0
  gpu: 922.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 205.0
  cpu2: 616.0
  gpu: 28.0
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 688.0
  cpu2: 2064.0
  gpu: 814.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 37.0
  cpu2: 37.0
  gpu: 999999.0
}
