layer {
  name: "front"
  time_unit: "usec"
  cpu: 1943.0
  cpu2: 1943.0
  gpu: 999999.0
}
layer {
  name: "c1"
  time_unit: "usec"
  cpu: 4274.0
  cpu2: 4274.0
  gpu: 1073.0
}
layer {
  name: "c2"
  time_unit: "usec"
  cpu: 4760.0
  cpu2: 4760.0
  gpu: 1137.0
}
layer {
  name: "c3"
  time_unit: "usec"
  cpu: 3748.0
  cpu2: 3748.0
  gpu: 538.0
}
layer {
  name: "c4"
  time_unit: "usec"
  cpu: 2526.0
  cpu2: 2526.0
  gpu: 742.0
}
layer {
  name: "c5"
  time_unit: "usec"
  cpu: 11086.0
  cpu2: 11086.0
  gpu: 1913.0
}
layer {
  name: "c6"
  time_unit: "usec"
  cpu: 3408.0
  cpu2: 3408.0
  gpu: 689.0
}
layer {
  name: "c7"
  time_unit: "usec"
  cpu: 1924.0
  cpu2: 1924.0
  gpu: 548.0
}
layer {
  name: "c8"
  time_unit: "usec"
  cpu: 5106.0
  cpu2: 5106.0
  gpu: 989.0
}
layer {
  name: "c9"
  time_unit: "usec"
  cpu: 4388.0
  cpu2: 4388.0
  gpu: 621.0
}
layer {
  name: "c10"
  time_unit: "usec"
  cpu: 2556.0
  cpu2: 2556.0
  gpu: 681.0
}
layer {
  name: "s1"
  time_unit: "usec"
  cpu: 238.0
  cpu2: 238.0
  gpu: 56.0
}
layer {
  name: "c11"
  time_unit: "usec"
  cpu: 4888.0
  cpu2: 4888.0
  gpu: 988.0
}
layer {
  name: "c12"
  time_unit: "usec"
  cpu: 1774.0
  cpu2: 1774.0
  gpu: 442.0
}
layer {
  name: "c13"
  time_unit: "usec"
  cpu: 1064.0
  cpu2: 1064.0
  gpu: 449.0
}
layer {
  name: "c14"
  time_unit: "usec"
  cpu: 2064.0
  cpu2: 2064.0
  gpu: 620.0
}
layer {
  name: "c15"
  time_unit: "usec"
  cpu: 2114.0
  cpu2: 2114.0
  gpu: 392.0
}
layer {
  name: "c16"
  time_unit: "usec"
  cpu: 1260.0
  cpu2: 1260.0
  gpu: 516.0
}
layer {
  name: "s2"
  time_unit: "usec"
  cpu: 154.0
  cpu2: 154.0
  gpu: 17.0
}
layer {
  name: "c17"
  time_unit: "usec"
  cpu: 2166.0
  cpu2: 2166.0
  gpu: 626.0
}
layer {
  name: "c18"
  time_unit: "usec"
  cpu: 2100.0
  cpu2: 2100.0
  gpu: 405.0
}
layer {
  name: "c19"
  time_unit: "usec"
  cpu: 1302.0
  cpu2: 1302.0
  gpu: 524.0
}
layer {
  name: "s3"
  time_unit: "usec"
  cpu: 156.0
  cpu2: 156.0
  gpu: 18.0
}
layer {
  name: "c20"
  time_unit: "usec"
  cpu: 2196.0
  cpu2: 2196.0
  gpu: 629.0
}
layer {
  name: "c21"
  time_unit: "usec"
  cpu: 2100.0
  cpu2: 2100.0
  gpu: 407.0
}
layer {
  name: "c22"
  time_unit: "usec"
  cpu: 1634.0
  cpu2: 1634.0
  gpu: 582.0
}
layer {
  name: "c23"
  time_unit: "usec"
  cpu: 4060.0
  cpu2: 4060.0
  gpu: 973.0
}
layer {
  name: "c24"
  time_unit: "usec"
  cpu: 3946.0
  cpu2: 3946.0
  gpu: 556.0
}
layer {
  name: "c25"
  time_unit: "usec"
  cpu: 2406.0
  cpu2: 2406.0
  gpu: 859.0
}
layer {
  name: "s4"
  time_unit: "usec"
  cpu: 200.0
  cpu2: 200.0
  gpu: 36.0
}
layer {
  name: "c26"
  time_unit: "usec"
  cpu: 4134.0
  cpu2: 4134.0
  gpu: 965.0
}
layer {
  name: "c27"
  time_unit: "usec"
  cpu: 3974.0
  cpu2: 3974.0
  gpu: 563.0
}
layer {
  name: "c28"
  time_unit: "usec"
  cpu: 2492.0
  cpu2: 2492.0
  gpu: 863.0
}
layer {
  name: "s5"
  time_unit: "usec"
  cpu: 198.0
  cpu2: 198.0
  gpu: 36.0
}
layer {
  name: "c29"
  time_unit: "usec"
  cpu: 4092.0
  cpu2: 4092.0
  gpu: 981.0
}
layer {
  name: "c30"
  time_unit: "usec"
  cpu: 3978.0
  cpu2: 3978.0
  gpu: 552.0
}
layer {
  name: "c31"
  time_unit: "usec"
  cpu: 2460.0
  cpu2: 2460.0
  gpu: 861.0
}
layer {
  name: "s6"
  time_unit: "usec"
  cpu: 200.0
  cpu2: 200.0
  gpu: 36.0
}
layer {
  name: "c32"
  time_unit: "usec"
  cpu: 4226.0
  cpu2: 4226.0
  gpu: 979.0
}
layer {
  name: "c33"
  time_unit: "usec"
  cpu: 1518.0
  cpu2: 1518.0
  gpu: 436.0
}
layer {
  name: "c34"
  time_unit: "usec"
  cpu: 960.0
  cpu2: 960.0
  gpu: 582.0
}
layer {
  name: "c35"
  time_unit: "usec"
  cpu: 1996.0
  cpu2: 1996.0
  gpu: 692.0
}
layer {
  name: "c36"
  time_unit: "usec"
  cpu: 1830.0
  cpu2: 1830.0
  gpu: 433.0
}
layer {
  name: "c37"
  time_unit: "usec"
  cpu: 1462.0
  cpu2: 1462.0
  gpu: 757.0
}
layer {
  name: "s7"
  time_unit: "usec"
  cpu: 126.0
  cpu2: 126.0
  gpu: 15.0
}
layer {
  name: "c38"
  time_unit: "usec"
  cpu: 2024.0
  cpu2: 2024.0
  gpu: 696.0
}
layer {
  name: "c39"
  time_unit: "usec"
  cpu: 1804.0
  cpu2: 1804.0
  gpu: 436.0
}
layer {
  name: "c40"
  time_unit: "usec"
  cpu: 1480.0
  cpu2: 1480.0
  gpu: 752.0
}
layer {
  name: "s8"
  time_unit: "usec"
  cpu: 116.0
  cpu2: 116.0
  gpu: 15.0
}
layer {
  name: "c41"
  time_unit: "usec"
  cpu: 2064.0
  cpu2: 2064.0
  gpu: 705.0
}
layer {
  name: "c42"
  time_unit: "usec"
  cpu: 1206.0
  cpu2: 1206.0
  gpu: 392.0
}
layer {
  name: "c43"
  time_unit: "usec"
  cpu: 1752.0
  cpu2: 1752.0
  gpu: 713.0
}
layer {
  name: "c44"
  time_unit: "usec"
  cpu: 3022.0
  cpu2: 3022.0
  gpu: 600.0
}
layer {
  name: "c45"
  time_unit: "usec"
  cpu: 1676.0
  cpu2: 1676.0
  gpu: 359.0
}
layer {
  name: "c46"
  time_unit: "usec"
  cpu: 2714.0
  cpu2: 2714.0
  gpu: 946.0
}
layer {
  name: "s9"
  time_unit: "usec"
  cpu: 124.0
  cpu2: 124.0
  gpu: 13.0
}
layer {
  name: "c47"
  time_unit: "usec"
  cpu: 2970.0
  cpu2: 2970.0
  gpu: 594.0
}
layer {
  name: "c48"
  time_unit: "usec"
  cpu: 1650.0
  cpu2: 1650.0
  gpu: 363.0
}
layer {
  name: "c49"
  time_unit: "usec"
  cpu: 2724.0
  cpu2: 2724.0
  gpu: 950.0
}
layer {
  name: "s10"
  time_unit: "usec"
  cpu: 122.0
  cpu2: 122.0
  gpu: 13.0
}
layer {
  name: "c50"
  time_unit: "usec"
  cpu: 2944.0
  cpu2: 2944.0
  gpu: 606.0
}
layer {
  name: "c51"
  time_unit: "usec"
  cpu: 1668.0
  cpu2: 1668.0
  gpu: 358.0
}
layer {
  name: "c52"
  time_unit: "usec"
  cpu: 4898.0
  cpu2: 4898.0
  gpu: 991.0
}
layer {
  name: "c53"
  time_unit: "usec"
  cpu: 6206.0
  cpu2: 6206.0
  gpu: 922.0
}
layer {
  name: "p1"
  time_unit: "usec"
  cpu: 308.0
  cpu2: 308.0
  gpu: 28.0
}
layer {
  name: "c54"
  time_unit: "usec"
  cpu: 1032.0
  cpu2: 1032.0
  gpu: 814.0
}
layer {
  name: "back"
  time_unit: "usec"
  cpu: 37.0
  cpu2: 37.0
  gpu: 999999.0
}
